riversnails/ti-aoa/projects/v5_rtls_responder_CC1352R1_LAUNCHXL_tirtos_ccs/Release/configPkg/package/cfg/rtls_responder_app_pem4f.c
/* Module__loggerObj__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Module__loggerObj__C, ".const:ti_sysbios_heaps_HeapCallback_Module__loggerObj__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerObj ti_sysbios_heaps_HeapCallback_Module__loggerObj__C = ((const CT__ti_sysbios_heaps_HeapCallback_Module__loggerObj)NULL);

/* Module__loggerFxn0__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Module__loggerFxn0__C, ".const:ti_sysbios_heaps_HeapCallback_Module__loggerFxn0__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn0 ti_sysbios_heaps_HeapCallback_Module__loggerFxn0__C = ((const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn0)NULL);

/* Module__loggerFxn1__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Module__loggerFxn1__C, ".const:ti_sysbios_heaps_HeapCallback_Module__loggerFxn1__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn1 ti_sysbios_heaps_HeapCallback_Module__loggerFxn1__C = ((const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn1)NULL);

/* Module__loggerFxn2__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Module__loggerFxn2__C, ".const:ti_sysbios_heaps_HeapCallback_Module__loggerFxn2__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn2 ti_sysbios_heaps_HeapCallback_Module__loggerFxn2__C = ((const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn2)NULL);

/* Module__loggerFxn4__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Module__loggerFxn4__C, ".const:ti_sysbios_heaps_HeapCallback_Module__loggerFxn4__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn4 ti_sysbios_heaps_HeapCallback_Module__loggerFxn4__C = ((const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn4)NULL);

/* Module__loggerFxn8__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Module__loggerFxn8__C, ".const:ti_sysbios_heaps_HeapCallback_Module__loggerFxn8__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn8 ti_sysbios_heaps_HeapCallback_Module__loggerFxn8__C = ((const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn8)NULL);

/* Object__count__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Object__count__C, ".const:ti_sysbios_heaps_HeapCallback_Object__count__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Object__count ti_sysbios_heaps_HeapCallback_Object__count__C = 1;

/* Object__heap__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Object__heap__C, ".const:ti_sysbios_heaps_HeapCallback_Object__heap__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Object__heap ti_sysbios_heaps_HeapCallback_Object__heap__C = NULL;

/* Object__sizeof__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Object__sizeof__C, ".const:ti_sysbios_heaps_HeapCallback_Object__sizeof__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Object__sizeof ti_sysbios_heaps_HeapCallback_Object__sizeof__C = sizeof(ti_sysbios_heaps_HeapCallback_Object__);

/* Object__table__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_Object__table__C, ".const:ti_sysbios_heaps_HeapCallback_Object__table__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Object__table ti_sysbios_heaps_HeapCallback_Object__table__C = ti_sysbios_heaps_HeapCallback_Object__table__V;

/* allocInstFxn__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_allocInstFxn__C, ".const:ti_sysbios_heaps_HeapCallback_allocInstFxn__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_allocInstFxn ti_sysbios_heaps_HeapCallback_allocInstFxn__C = ((const CT__ti_sysbios_heaps_HeapCallback_allocInstFxn)(osalHeapAllocFxn));

/* createInstFxn__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_createInstFxn__C, ".const:ti_sysbios_heaps_HeapCallback_createInstFxn__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_createInstFxn ti_sysbios_heaps_HeapCallback_createInstFxn__C = ((const CT__ti_sysbios_heaps_HeapCallback_createInstFxn)(ti_sysbios_heaps_HeapCallback_defaultCreate));

/* deleteInstFxn__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_deleteInstFxn__C, ".const:ti_sysbios_heaps_HeapCallback_deleteInstFxn__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_deleteInstFxn ti_sysbios_heaps_HeapCallback_deleteInstFxn__C = ((const CT__ti_sysbios_heaps_HeapCallback_deleteInstFxn)(ti_sysbios_heaps_HeapCallback_defaultDelete));

/* freeInstFxn__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_freeInstFxn__C, ".const:ti_sysbios_heaps_HeapCallback_freeInstFxn__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_freeInstFxn ti_sysbios_heaps_HeapCallback_freeInstFxn__C = ((const CT__ti_sysbios_heaps_HeapCallback_freeInstFxn)(osalHeapFreeFxn));

/* getStatsInstFxn__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_getStatsInstFxn__C, ".const:ti_sysbios_heaps_HeapCallback_getStatsInstFxn__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_getStatsInstFxn ti_sysbios_heaps_HeapCallback_getStatsInstFxn__C = ((const CT__ti_sysbios_heaps_HeapCallback_getStatsInstFxn)(osalHeapGetStatsFxn));

/* initInstFxn__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_initInstFxn__C, ".const:ti_sysbios_heaps_HeapCallback_initInstFxn__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_initInstFxn ti_sysbios_heaps_HeapCallback_initInstFxn__C = ((const CT__ti_sysbios_heaps_HeapCallback_initInstFxn)(osalHeapInitFxn));

/* isBlockingInstFxn__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapCallback_isBlockingInstFxn__C, ".const:ti_sysbios_heaps_HeapCallback_isBlockingInstFxn__C");
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_isBlockingInstFxn ti_sysbios_heaps_HeapCallback_isBlockingInstFxn__C = ((const CT__ti_sysbios_heaps_HeapCallback_isBlockingInstFxn)(osalHeapIsBlockingFxn));


/*
 * ======== ti.sysbios.heaps.HeapMem INITIALIZERS ========
 */


/* Object__PARAMS__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapMem_Object__PARAMS__C, ".const:ti_sysbios_heaps_HeapMem_Object__PARAMS__C");
__FAR__ const ti_sysbios_heaps_HeapMem_Params ti_sysbios_heaps_HeapMem_Object__PARAMS__C = {
    sizeof (ti_sysbios_heaps_HeapMem_Params), /* __size */
    NULL, /* __self */
    NULL, /* __fxns */
    (xdc_runtime_IInstance_Params*)&ti_sysbios_heaps_HeapMem_Object__PARAMS__C.__iprms, /* instance */
    (xdc_SizeT)0x0,  /* minBlockAlign */
    ((xdc_Ptr)(0x0)),  /* buf */
    ((xdc_UArg)(0x0)),  /* size */
    {
        sizeof (xdc_runtime_IInstance_Params), /* __size */
        0,  /* name */
    },  /* instance */
};

/* Module__root__V */
ti_sysbios_heaps_HeapMem_Module__ ti_sysbios_heaps_HeapMem_Module__root__V = {
    {&ti_sysbios_heaps_HeapMem_Module__root__V.link,  /* link.next */
    &ti_sysbios_heaps_HeapMem_Module__root__V.link},  /* link.prev */
};

/* Module__diagsEnabled__C */
#pragma DATA_SECTION(ti_sysbios_heaps_HeapMem_Module__diagsEnabled__C, ".const:ti_sysbios_heaps_HeapMem_Module__diagsEnabled__C");
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__diagsEnabled ti_sysbios_heaps_HeapMem_Module__diagsEnabled__C = (xdc_Bits32)0x90U;

